<?php
// *Объединить две ранее написанные функции в одну, которая получает строку на русском
// языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача
// решается при конструировании url-адресов на основе названия статьи в блогах).

function transliteration($string) {
    $letters = [
        "а" => "a", 
		"б" => "b", 
		"в" => "v", 
		"г" => "g", 
		"д" => "d", 
		"е" => "e", 
		"ё" => "yo",
		"ж" => "zh", 
		"з" => "z", 
		"и" => "i", 
		"й" => "y", 
		"к" => "k", 
		"л" => "l", 
		"м" => "m",
		"н" => "n", 
		"о" => "o", 
		"п" => "p", 
		"р" => "r", 
		"с" => "s", 
		"т" => "t", 
		"у" => "u",
		"ф" => "f", 
		"х" => "h", 
		"ц" => "ts", 
		"ч" => "ch", 
		"ш" => "sh", 
		"щ" => "s'h", 
		"ъ" => "",
		"ы" => "i", 
		"ь" => "'", 
		"э" => "e", 
		"ю" => "yu", 
		"я" => "ya",
];
$string = mb_strtolower($string);
$string = str_replace(" ", "_", $string);
    $res = strtr($string, $letters);
    echo $res;
}

transliteration("БоЛьшОй текст о чем-нибудь");